tap "d12frosted/emacs-plus"

brew "stow"
brew "git-delta"
brew "jj"
brew "tmux"
brew "ripgrep"
brew "coreutils"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "cmake"
brew "pkg-config"
brew "sccache"
brew "cargo-binstall"

# linux <> macos tomfoolery
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"

cask "emacs-plus-app"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-cjk"
cask "font-symbols-only-nerd-font"

brew "libpq"
cask "orbstack"
brew "mise"
brew "node"
brew "pnpm"

cask "ghostty"

